---
kind: enumMember
id: F:Autodesk.Revit.DB.RenderNodeAction.Skip
enum: Autodesk.Revit.DB.RenderNodeAction
source: html/39f98799-628b-8d65-765c-ca86949ce7ed.htm
---
# Autodesk.Revit.DB.RenderNodeAction.Skip

Instruct the exporter to skip the node. It means the exporter
 will not process any child nodes (nor the geometry) of the node.
 The respective end-node notification will still be invoked though.